{"Directions": ["Line a baking sheet with parchment paper. Trace two 8-in. circles 1 in. apart on paper; set aside. In a mixing bowl, beat egg whites and cream of tartar until soft peaks form. Sift confectioners' sugar and cocoa over meringue; gently fold in. Fold in vanilla. Spread evenly over circles. Bake at 275 degrees F for 1 hour. Turn oven off and do not open door; let meringues dry for 1 hour. Remove from oven; cool on baking sheet. When completely cool, remove meringues from paper; store in an airtight container.", "In a mixing bowl, cream butter and sugar for 2 minutes. Add egg, then egg white, one at a time, beating well after each addition. Beat on high speed until light and fluffy. Stir in vinegar and vanilla. Combine flour, cocoa and baking soda; add to batter alternately with buttermilk and water.", "Pour into two 9-in. round baking pans coated with nonstick cooking spray and floured. Bake at 350 degrees F for 20-25 minutes or until a toothpick comes out clean. Cool for 10 minutes before removing from pans to wire racks. To assemble, spread 1/2 cup whipped topping over one cake layer; top with a meringue and another 1/2 cup topping. Top with second cake layer, 1/2 cup topping, second meringue and remaining topping. Sprinkle with toffee bits and shaved chocolate."], "Image": "http://images.media-allrecipes.com/userphotos/250x250/984195.jpg", "Recipe": "Chocolate Meringue Torte", "Ingredients": ["4 egg whites", "1/2 teaspoon cream of tartar", "2/3 cup sugar", "2/3 cup confectioners' sugar", "3 tablespoons baking cocoa", "1/2 teaspoon vanilla extract", "CAKE:", "1/4 cup butter or stick margarine, softened", "1 cup sugar", "1 egg", "1 egg white", "1 tablespoon white vinegar", "1 teaspoon vanilla extract", "1 1/2 cups all-purpose flour", "1/2 cup baking cocoa", "1 teaspoon baking soda", "1/2 cup 1% buttermilk", "1/2 cup water", "2 1/2 cups reduced-fat whipped topping", "1 tablespoon toffee bits or almond brickle chips", "1/2 (1 ounce) square semisweet chocolate, grated"]}