{"Directions": ["In a large mixing bowl, dissolve yeast in warm water. Add the milk, sugar, butter, eggs, salt, orange peel, cardamom, mace and 2 cups flour. Beat until smooth. Stir in enough remaining flour to form a soft dough. Turn onto a floured surface; knead until smooth and elastic, about 6-8 minutes. Place in a greased bowl, turning once to grease top. Cover and let rise in a warm place until doubled, about 1 hour.", "Meanwhile, for filling, in a small mixing bowl, combine the butter, sugar, extract and orange peel; set aside. Toss the fruit and almonds with flour; set aside.", "Punch dough down. Turn onto a lightly floured surface. Roll into a 30-in. x 9-in. rectangle. Spread filling to within 1/2 in. of edges; sprinkle with fruit mixture. Roll up jelly-roll style, starting with a long side; pinch seam to seal. With a sharp knife, cut roll in half lengthwise. Place on a greased baking sheet; gently twist the ropes together cut side up. Coil into a circle; tuck ends under. Cover and let rise until doubled, about 1 hour.", "Bake at 325 degrees F for 30-35 minutes or until golden brown. Remove from pan to a wire rack to cool. In a mixing bowl, combine orange butter ingredients. Refrigerate until serving. Serve with coffee cake."], "Image": "http://images.media-allrecipes.com/userphotos/250x250/984192.jpg", "Recipe": "Holiday Breakfast Braid", "Ingredients": ["1 (.25 ounce) package active dry yeast", "1/4 cup warm water (105 degrees to 115 degrees)", "1/2 cup warm milk (110 to 115 degrees F)", "1/3 cup sugar", "1/3 cup butter or margarine, softened", "2 eggs, beaten", "1 teaspoon salt", "1 teaspoon grated orange peel", "1/2 teaspoon ground cardamom", "1/8 teaspoon ground mace", "3 1/2 cups all-purpose flour", "FILLING:", "1/4 cup butter or margarine, softened", "2 tablespoons sugar", "3/4 teaspoon almond extract", "1/2 teaspoon grated orange peel", "1/2 cup chopped mixed candied fruit", "1/2 cup chopped almonds", "2 teaspoons all-purpose flour", "ORANGE BUTTER:", "1/2 cup butter (no substitutes), softened", "2 tablespoons confectioners' sugar", "1 teaspoon grated orange peel"]}